MyoMod/MyoMod-DPU/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define BOARD_INITDEBUG_UART_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x01U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INITDEBUG_UART_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x07010000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_AD_B0_10 (coord G13), SWO */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_INT1_COMBO_PERIPHERAL                           ARM   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_INT1_COMBO_SIGNAL                     arm_trace_swo   /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), UART1_RX */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_ASYNC_CTRL_DPU_RX_PERIPHERAL                LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_ASYNC_CTRL_DPU_RX_SIGNAL                         RX   /*!< Signal name */

/* GPIO_AD_B0_12 (coord K14), UART1_TX */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_ASYNC_CTRL_DPU_TX_PERIPHERAL                LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_ASYNC_CTRL_DPU_TX_SIGNAL                         TX   /*!< Signal name */

/* GPIO_AD_B0_00 (coord M14), ESP_EN */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_ESP_EN_PERIPHERAL                             GPIO1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_ESP_EN_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITDEBUG_UART_ESP_EN_CHANNEL                                   0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UART_ESP_EN_GPIO                                   GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UART_ESP_EN_GPIO_PIN                                  0U   /*!< GPIO pin number */
#define BOARD_INITDEBUG_UART_ESP_EN_GPIO_PIN_MASK                     (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITDEBUG_UART_ESP_EN_PORT                                   GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITDEBUG_UART_ESP_EN_PIN                                       0U   /*!< PORT pin number */
#define BOARD_INITDEBUG_UART_ESP_EN_PIN_MASK                          (1U << 0U)   /*!< PORT pin mask */

/* GPIO_B1_09 (coord A13), DEBUG2 */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_DEBUG2_PERIPHERAL                             GPIO7   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_DEBUG2_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITDEBUG_UART_DEBUG2_CHANNEL                                  25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UART_DEBUG2_GPIO                                   GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG2_GPIO_PIN                                 25U   /*!< GPIO pin number */
#define BOARD_INITDEBUG_UART_DEBUG2_GPIO_PIN_MASK                    (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITDEBUG_UART_DEBUG2_PORT                                   GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG2_PIN                                      25U   /*!< PORT pin number */
#define BOARD_INITDEBUG_UART_DEBUG2_PIN_MASK                         (1U << 25U)   /*!< PORT pin mask */

/* GPIO_B1_10 (coord B13), DEBUG3 */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_DEBUG3_PERIPHERAL                             GPIO7   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_DEBUG3_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITDEBUG_UART_DEBUG3_CHANNEL                                  26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UART_DEBUG3_GPIO                                   GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG3_GPIO_PIN                                 26U   /*!< GPIO pin number */
#define BOARD_INITDEBUG_UART_DEBUG3_GPIO_PIN_MASK                    (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITDEBUG_UART_DEBUG3_PORT                                   GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG3_PIN                                      26U   /*!< PORT pin number */
#define BOARD_INITDEBUG_UART_DEBUG3_PIN_MASK                         (1U << 26U)   /*!< PORT pin mask */

/* GPIO_B1_08 (coord A12), DEBUG1 */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_DEBUG1_PERIPHERAL                             GPIO7   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_DEBUG1_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITDEBUG_UART_DEBUG1_CHANNEL                                  24U   /*!< Signal channel */

