MyoMod/MyoMod-DPU/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UART_DEBUG1_GPIO                                   GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG1_GPIO_PIN                                 24U   /*!< GPIO pin number */
#define BOARD_INITDEBUG_UART_DEBUG1_GPIO_PIN_MASK                    (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITDEBUG_UART_DEBUG1_PORT                                   GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG1_PIN                                      24U   /*!< PORT pin number */
#define BOARD_INITDEBUG_UART_DEBUG1_PIN_MASK                         (1U << 24U)   /*!< PORT pin mask */

/* GPIO_B1_00 (coord A11), DEBUG0 */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_DEBUG0_PERIPHERAL                             GPIO7   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_DEBUG0_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITDEBUG_UART_DEBUG0_CHANNEL                                  16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UART_DEBUG0_GPIO                                   GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG0_GPIO_PIN                                 16U   /*!< GPIO pin number */
#define BOARD_INITDEBUG_UART_DEBUG0_GPIO_PIN_MASK                    (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INITDEBUG_UART_DEBUG0_PORT                                   GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG0_PIN                                      16U   /*!< PORT pin number */
#define BOARD_INITDEBUG_UART_DEBUG0_PIN_MASK                         (1U << 16U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK */
/* Routed pin properties */
#define QSPI_FLASH_FlexSPI_CLK_PERIPHERAL                                FLEXSPI   /*!< Peripheral name */
#define QSPI_FLASH_FlexSPI_CLK_SIGNAL                             FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A */
/* Routed pin properties */
#define QSPI_FLASH_FlexSPI_D2_A_PERIPHERAL                               FLEXSPI   /*!< Peripheral name */
#define QSPI_FLASH_FlexSPI_D2_A_SIGNAL                           FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A */
/* Routed pin properties */
#define QSPI_FLASH_FlexSPI_D0_A_PERIPHERAL                               FLEXSPI   /*!< Peripheral name */
#define QSPI_FLASH_FlexSPI_D0_A_SIGNAL                           FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A */
/* Routed pin properties */
#define QSPI_FLASH_FlexSPI_D1_A_PERIPHERAL                               FLEXSPI   /*!< Peripheral name */
#define QSPI_FLASH_FlexSPI_D1_A_SIGNAL                           FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B1_06 (coord L3), FlexSPI_SS0 */
/* Routed pin properties */
#define QSPI_FLASH_FlexSPI_SS0_PERIPHERAL                                FLEXSPI   /*!< Peripheral name */
#define QSPI_FLASH_FlexSPI_SS0_SIGNAL                            FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A */
/* Routed pin properties */
#define QSPI_FLASH_FlexSPI_D3_A_PERIPHERAL                               FLEXSPI   /*!< Peripheral name */
#define QSPI_FLASH_FlexSPI_D3_A_SIGNAL                           FLEXSPI_A_DATA3   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void QSPI_Flash(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RAM(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Boot_Config(void);

#define EXTERNAL_CONNECTIONS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0xE0000000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */
#define EXTERNAL_CONNECTIONS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK 0x010000U /*!< GPIO3 and GPIO8 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */
#define EXTERNAL_CONNECTIONS_IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL_MASK 0x40U /*!< GPIO4 and GPIO9 share same IO MUX function, GPIO_MUX4 selects one GPIO function: affected bits mask */

/* GPIO_AD_B1_01 (coord K11), I2C1_SDA */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_EXT_SDA_PERIPHERAL                           LPI2C1   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_EXT_SDA_SIGNAL                                  SDA   /*!< Signal name */

/* GPIO_AD_B1_00 (coord J11), I2C1_SCL */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_EXT_SCL_PERIPHERAL                           LPI2C1   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_EXT_SCL_SIGNAL                                  SCL   /*!< Signal name */

/* GPIO_SD_B0_00 (coord J4), I2C3_SDA */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_ESP_SDA_PERIPHERAL                           LPI2C3   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_ESP_SDA_SIGNAL                                  SCL   /*!< Signal name */

/* GPIO_SD_B0_01 (coord J3), I2C3_SCL */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_ESP_SCL_PERIPHERAL                           LPI2C3   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_ESP_SCL_SIGNAL                                  SDA   /*!< Signal name */

/* GPIO_AD_B1_15 (coord J14), SPI3_SCK */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_ADC_SCK_PERIPHERAL                           LPSPI3   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_ADC_SCK_SIGNAL                                  SCK   /*!< Signal name */

/* GPIO_AD_B1_13 (coord H11), SPI3_MISO */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_ADC_MISO_PERIPHERAL                          LPSPI3   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_ADC_MISO_SIGNAL                                 SDI   /*!< Signal name */

/* GPIO_AD_B1_14 (coord G12), SPI3_MOSI */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_ADC_MOSI_PERIPHERAL                          LPSPI3   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_ADC_MOSI_SIGNAL                                 SDO   /*!< Signal name */

