MyoMod/MyoMod-DPU/board/pin_mux.h
/* GPIO_AD_B1_12 (coord H12), SPI3_CS */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_ADC_CS_PERIPHERAL                            LPSPI3   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_ADC_CS_SIGNAL                                  PCS0   /*!< Signal name */

/* GPIO_EMC_07 (coord H4), FLEX_SDA */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_BAT_SDA_PERIPHERAL                          FLEXIO1   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_BAT_SDA_SIGNAL                                   IO   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_BAT_SDA_CHANNEL                                  7U   /*!< Signal channel */

/* GPIO_EMC_08 (coord H3), FLEX_SCL */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_BAT_SCL_PERIPHERAL                          FLEXIO1   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_BAT_SCL_SIGNAL                                   IO   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_BAT_SCL_CHANNEL                                  8U   /*!< Signal channel */

/* GPIO_B1_04 (coord E12), SPI4_CS */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_IMU_CS_PERIPHERAL                            LPSPI4   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_IMU_CS_SIGNAL                                  PCS0   /*!< Signal name */

/* GPIO_B1_07 (coord B12), SPI4_CLK */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_IMU_CLK_PERIPHERAL                           LPSPI4   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_IMU_CLK_SIGNAL                                  SCK   /*!< Signal name */

/* GPIO_B1_05 (coord D12), SPI4_MISO */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_IMU_MISO_PERIPHERAL                          LPSPI4   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_IMU_MISO_SIGNAL                                 SDI   /*!< Signal name */

/* GPIO_B1_06 (coord C12), SPI4_MOSI */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_IMU_MOSI_PERIPHERAL                          LPSPI4   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_IMU_MOSI_SIGNAL                                 SDO   /*!< Signal name */

/* GPIO_B1_15 (coord B14), IMU_SYNC */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_IMU_SYNC_PERIPHERAL                           GPIO7   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_IMU_SYNC_SIGNAL                             gpio_io   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_IMU_SYNC_CHANNEL                                31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define EXTERNAL_CONNECTIONS_IMU_SYNC_GPIO                                 GPIO7   /*!< GPIO peripheral base pointer */
#define EXTERNAL_CONNECTIONS_IMU_SYNC_GPIO_PIN                               31U   /*!< GPIO pin number */
#define EXTERNAL_CONNECTIONS_IMU_SYNC_GPIO_PIN_MASK                  (1U << 31U)   /*!< GPIO pin mask */
#define EXTERNAL_CONNECTIONS_IMU_SYNC_PORT                                 GPIO7   /*!< PORT peripheral base pointer */
#define EXTERNAL_CONNECTIONS_IMU_SYNC_PIN                                    31U   /*!< PORT pin number */
#define EXTERNAL_CONNECTIONS_IMU_SYNC_PIN_MASK                       (1U << 31U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), IMU_INT1 */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_IMU_INT1_PERIPHERAL                           GPIO7   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_IMU_INT1_SIGNAL                             gpio_io   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_IMU_INT1_CHANNEL                                30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define EXTERNAL_CONNECTIONS_IMU_INT1_GPIO                                 GPIO7   /*!< GPIO peripheral base pointer */
#define EXTERNAL_CONNECTIONS_IMU_INT1_GPIO_PIN                               30U   /*!< GPIO pin number */
#define EXTERNAL_CONNECTIONS_IMU_INT1_GPIO_PIN_MASK                  (1U << 30U)   /*!< GPIO pin mask */
#define EXTERNAL_CONNECTIONS_IMU_INT1_PORT                                 GPIO7   /*!< PORT peripheral base pointer */
#define EXTERNAL_CONNECTIONS_IMU_INT1_PIN                                    30U   /*!< PORT pin number */
#define EXTERNAL_CONNECTIONS_IMU_INT1_PIN_MASK                       (1U << 30U)   /*!< PORT pin mask */

/* GPIO_B1_13 (coord D14), IMU_INT2 */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_IMU_INT2_PERIPHERAL                           GPIO7   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_IMU_INT2_SIGNAL                             gpio_io   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_IMU_INT2_CHANNEL                                29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define EXTERNAL_CONNECTIONS_IMU_INT2_GPIO                                 GPIO7   /*!< GPIO peripheral base pointer */
#define EXTERNAL_CONNECTIONS_IMU_INT2_GPIO_PIN                               29U   /*!< GPIO pin number */
#define EXTERNAL_CONNECTIONS_IMU_INT2_GPIO_PIN_MASK                  (1U << 29U)   /*!< GPIO pin mask */
#define EXTERNAL_CONNECTIONS_IMU_INT2_PORT                                 GPIO7   /*!< PORT peripheral base pointer */
#define EXTERNAL_CONNECTIONS_IMU_INT2_PIN                                    29U   /*!< PORT pin number */
#define EXTERNAL_CONNECTIONS_IMU_INT2_PIN_MASK                       (1U << 29U)   /*!< PORT pin mask */

/* GPIO_EMC_06 (coord H5), BATMANG_INT */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_BATMANG_INT_PERIPHERAL                        GPIO9   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_BATMANG_INT_SIGNAL                          gpio_io   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_BATMANG_INT_CHANNEL                              6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define EXTERNAL_CONNECTIONS_BATMANG_INT_GPIO                              GPIO9   /*!< GPIO peripheral base pointer */
#define EXTERNAL_CONNECTIONS_BATMANG_INT_GPIO_PIN                             6U   /*!< GPIO pin number */
#define EXTERNAL_CONNECTIONS_BATMANG_INT_GPIO_PIN_MASK                (1U << 6U)   /*!< GPIO pin mask */
#define EXTERNAL_CONNECTIONS_BATMANG_INT_PORT                              GPIO9   /*!< PORT peripheral base pointer */
#define EXTERNAL_CONNECTIONS_BATMANG_INT_PIN                                  6U   /*!< PORT pin number */
#define EXTERNAL_CONNECTIONS_BATMANG_INT_PIN_MASK                     (1U << 6U)   /*!< PORT pin mask */

/* GPIO_SD_B0_03 (coord K1), RGB_B */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_RGB_B_PERIPHERAL                               PWM1   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_RGB_B_SIGNAL                                      B   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_RGB_B_CHANNEL                                    1U   /*!< Signal channel */

/* GPIO_SD_B0_02 (coord J1), RGB_G */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_RGB_G_PERIPHERAL                               PWM1   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_RGB_G_SIGNAL                                      A   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_RGB_G_CHANNEL                                    1U   /*!< Signal channel */

