MyoMod/MyoMod-DPU/board/pin_mux.h
/* GPIO_SD_B0_05 (coord J2), RGB_R */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_RGB_R_PERIPHERAL                               PWM1   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_RGB_R_SIGNAL                                      B   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_RGB_R_CHANNEL                                    2U   /*!< Signal channel */

/* GPIO_SD_B0_04 (coord H2), V_MYOMOD_EN */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_V_MYOMOD_EN_PERIPHERAL                        GPIO8   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_V_MYOMOD_EN_SIGNAL                          gpio_io   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_V_MYOMOD_EN_CHANNEL                             16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define EXTERNAL_CONNECTIONS_V_MYOMOD_EN_GPIO                              GPIO8   /*!< GPIO peripheral base pointer */
#define EXTERNAL_CONNECTIONS_V_MYOMOD_EN_GPIO_PIN                            16U   /*!< GPIO pin number */
#define EXTERNAL_CONNECTIONS_V_MYOMOD_EN_GPIO_PIN_MASK               (1U << 16U)   /*!< GPIO pin mask */
#define EXTERNAL_CONNECTIONS_V_MYOMOD_EN_PORT                              GPIO8   /*!< PORT peripheral base pointer */
#define EXTERNAL_CONNECTIONS_V_MYOMOD_EN_PIN                                 16U   /*!< PORT pin number */
#define EXTERNAL_CONNECTIONS_V_MYOMOD_EN_PIN_MASK                    (1U << 16U)   /*!< PORT pin mask */

/* GPIO_AD_B0_14 (coord H14), ADC_RDY */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_ADC_RDY_PERIPHERAL                           LPSPI3   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_ADC_RDY_SIGNAL                                  TRG   /*!< Signal name */

/* GPIO_AD_B1_09 (coord M13), V_BAT */
/* Routed pin properties */
#define EXTERNAL_CONNECTIONS_V_BAT_PERIPHERAL                               ADC1   /*!< Peripheral name */
#define EXTERNAL_CONNECTIONS_V_BAT_SIGNAL                                     IN   /*!< Signal name */
#define EXTERNAL_CONNECTIONS_V_BAT_CHANNEL                                   14U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void External_Connections(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
